# Exercise 02 -  OLAP Cubes - Solution

All the databases table in this demo are based on public database samples and transformations
- `Sakila` is a sample database created my `MySql` [Link](https://dev.mysql.com/doc/sakila/en/sakila-structure.html)
- The postgresql version of it is called `Pagila` [Link](https://github.com/devrimgunduz/pagila)
- The facts and dimension tables design is based on O'Reilly's public dimensional modelling tutorial schema [Link](http://archive.oreilly.com/oreillyschool/courses/dba3/index.html)

In [1]:
!PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila_star
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila_star -f Data/pagila-star.sql

 set_config
------------

(1 row)

 setval
--------
    200
(1 row)

 setval
--------
    605
(1 row)

 setval
--------
     16
(1 row)

 setval
--------
    600
(1 row)

 setval
--------
    109
(1 row)

 setval
--------
    599
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
  32098
(1 row)

 setval
--------
   1000
(1 row)

 setval
--------
   4581
(1 row)

 setval
--------
      6
(1 row)

 setval
--------
  32098
(1 row)

 setval
--------
  16049
(1 row)

 setval
--------
      2
(1 row)

 setval
--------
      2
(1 row)

In [2]:
%load_ext sql
import sql

# STEP1 : Connect to the local database where Pagila is loaded

In [3]:
DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://student:student@127.0.0.1:5432/pagila

In [4]:
%sql $conn_string

# STEP2 :  Facts & Dimensions are supposed to be loaded from Demo01

<img src="pagila-star.png" width="50%"/>

# Start by a simple cube

In [5]:
%%time
%%sql
SELECT dimDate.day,dimMovie.rating, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales 
JOIN dimMovie     on (dimMovie.movie_key         = factSales.movie_key)
JOIN dimDate      on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer  on (dimCustomer.customer_key = factSales.customer_key)
group by (dimDate.day, dimMovie.rating, dimCustomer.city)
order by revenue desc
limit  20;

 * postgresql://student:***@127.0.0.1:5432/pagila
20 rows affected.
CPU times: user 3.03 ms, sys: 0 ns, total: 3.03 ms
Wall time: 52.6 ms

[(30, 'G', 'San Bernardino', Decimal('49.94')),
 (30, 'NC-17', 'Apeldoorn', Decimal('47.90')),
 (21, 'NC-17', 'Belm', Decimal('45.94')),
 (28, 'R', 'Mwanza', Decimal('43.94')),
 (21, 'G', 'Citt del Vaticano', Decimal('43.94')),
 (30, 'PG-13', 'Zanzibar', Decimal('43.94')),
 (1, 'R', 'Qomsheh', Decimal('39.94')),
 (28, 'PG-13', 'Dhaka', Decimal('39.94')),
 (17, 'G', 'Rajkot', Decimal('39.94')),
 (22, 'R', 'Yangor', Decimal('39.94')),
 (19, 'PG', 'Najafabad', Decimal('39.92')),
 (30, 'R', 'Fengshan', Decimal('39.90')),
 (28, 'PG', 'So Leopoldo', Decimal('37.96')),
 (21, 'G', 'Wroclaw', Decimal('37.96')),
 (1, 'NC-17', 'Memphis', Decimal('37.94')),
 (19, 'PG', 'Sokoto', Decimal('37.94')),
 (29, 'PG-13', 'Shimoga', Decimal('37.94')),
 (30, 'G', 'Omdurman', Decimal('37.94')),
 (30, 'PG-13', 'Osmaniye', Decimal('37.94')),
 (21, 'PG-13', 'Asuncin', Decimal('37.90'))]

## Slicing

- Slicing is the reduction of the dimensionality of a cube by 1 e.g. 3 dimensions to 2,  fixing one of the dimensions to a single value
- In the following example we have a 3-deminensional cube on day, rating, and country
- In the example below `rating` is fixed and to "PG-13" which reduces the dimensionality

In [6]:
%%time
%%sql
SELECT dimDate.day,dimMovie.rating, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales
JOIN dimMovie     on (dimMovie.movie_key         = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
WHERE dimMovie.rating = 'PG-13'
GROUP by (dimDate.day, dimCustomer.city, dimMovie.rating)
ORDER by revenue desc
LIMIT  20;

 * postgresql://student:***@127.0.0.1:5432/pagila
20 rows affected.
CPU times: user 2.28 ms, sys: 0 ns, total: 2.28 ms
Wall time: 8.88 ms

[(30, 'PG-13', 'Zanzibar', Decimal('43.94')),
 (28, 'PG-13', 'Dhaka', Decimal('39.94')),
 (29, 'PG-13', 'Shimoga', Decimal('37.94')),
 (30, 'PG-13', 'Osmaniye', Decimal('37.94')),
 (21, 'PG-13', 'Asuncin', Decimal('37.90')),
 (20, 'PG-13', 'Baha Blanca', Decimal('35.96')),
 (30, 'PG-13', 'Nagareyama', Decimal('35.96')),
 (21, 'PG-13', 'Parbhani', Decimal('35.96')),
 (30, 'PG-13', 'Tanauan', Decimal('35.92')),
 (17, 'PG-13', 'Ikerre', Decimal('35.90')),
 (30, 'PG-13', 'Zhoushan', Decimal('33.96')),
 (30, 'PG-13', 'Newcastle', Decimal('33.94')),
 (30, 'PG-13', 'Yerevan', Decimal('33.94')),
 (17, 'PG-13', 'Yantai', Decimal('31.96')),
 (8, 'PG-13', 'Pontianak', Decimal('31.96')),
 (30, 'PG-13', 'Santa Rosa', Decimal('31.96')),
 (20, 'PG-13', 'Santa Rosa', Decimal('31.96')),
 (20, 'PG-13', 'Johannesburg', Decimal('31.94')),
 (10, 'PG-13', 'Udaipur', Decimal('31.94')),
 (30, 'PG-13', 'Toulouse', Decimal('31.94'))]

## Dicing
 - Creating a subcube, same dimensionality, less values for 2 or more dimensions
 - e.g. PG-13

In [7]:
%%time
%%sql
SELECT dimDate.day,dimMovie.rating, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales
JOIN dimMovie     on (dimMovie.movie_key         = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
WHERE dimMovie.rating in ('PG-13', 'PG')
AND dimCustomer.city in ('Bellevue', 'Lancaster')
AND dimDate.day in ('1', '15', '30')
GROUP by (dimDate.day, dimCustomer.city, dimMovie.rating)
ORDER by revenue desc
LIMIT  20;

 * postgresql://student:***@127.0.0.1:5432/pagila
6 rows affected.
CPU times: user 2.56 ms, sys: 0 ns, total: 2.56 ms
Wall time: 4.4 ms

[(30, 'PG', 'Lancaster', Decimal('25.96')),
 (1, 'PG-13', 'Lancaster', Decimal('11.98')),
 (30, 'PG-13', 'Bellevue', Decimal('7.98')),
 (30, 'PG-13', 'Lancaster', Decimal('5.98')),
 (15, 'PG-13', 'Bellevue', Decimal('3.96')),
 (1, 'PG', 'Bellevue', Decimal('1.98'))]

## Roll-up
- Stepping up the level of aggregation to a large grouping
- e.g.`city` is summed as `country`

In [8]:
%%time
%%sql
SELECT dimDate.day,dimMovie.rating, dimCustomer.country, sum(sales_amount) as revenue
FROM factSales
JOIN dimMovie     on (dimMovie.movie_key         = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
GROUP by (dimDate.day,  dimMovie.rating, dimCustomer.country)
ORDER by revenue desc
LIMIT  20;

 * postgresql://student:***@127.0.0.1:5432/pagila
20 rows affected.
CPU times: user 2.37 ms, sys: 0 ns, total: 2.37 ms
Wall time: 40.6 ms

[(30, 'G', 'China', Decimal('339.34')),
 (30, 'PG', 'India', Decimal('313.34')),
 (30, 'NC-17', 'India', Decimal('307.28')),
 (30, 'PG-13', 'China', Decimal('293.34')),
 (30, 'R', 'China', Decimal('291.32')),
 (30, 'R', 'India', Decimal('287.36')),
 (30, 'G', 'India', Decimal('275.34')),
 (18, 'NC-17', 'India', Decimal('271.50')),
 (30, 'PG', 'China', Decimal('263.44')),
 (21, 'PG-13', 'India', Decimal('257.48')),
 (18, 'PG-13', 'India', Decimal('243.44')),
 (18, 'PG', 'India', Decimal('239.52')),
 (30, 'PG-13', 'India', Decimal('233.44')),
 (21, 'NC-17', 'China', Decimal('231.54')),
 (21, 'R', 'India', Decimal('231.50')),
 (27, 'NC-17', 'India', Decimal('231.44')),
 (17, 'PG-13', 'China', Decimal('223.50')),
 (17, 'NC-17', 'United States', Decimal('219.52')),
 (30, 'NC-17', 'China', Decimal('217.54')),
 (20, 'PG-13', 'India', Decimal('203.58'))]

## Drill-down
- Breaking up one of the dimensions to a lower level.
- e.g.`city` is broken up to  `districts`

In [9]:
%%time
%%sql
SELECT dimDate.day,dimMovie.rating, dimCustomer.district, sum(sales_amount) as revenue
FROM factSales
JOIN dimMovie     on (dimMovie.movie_key         = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
GROUP by (dimDate.day, dimCustomer.district, dimMovie.rating)
ORDER by revenue desc
LIMIT  20;

 * postgresql://student:***@127.0.0.1:5432/pagila
20 rows affected.
CPU times: user 2.45 ms, sys: 0 ns, total: 2.45 ms
Wall time: 46.6 ms

[(30, 'PG-13', 'Southern Tagalog', Decimal('107.76')),
 (30, 'G', 'Inner Mongolia', Decimal('77.86')),
 (30, 'G', 'Shandong', Decimal('73.86')),
 (30, 'NC-17', 'West Bengali', Decimal('73.84')),
 (17, 'PG-13', 'Shandong', Decimal('69.90')),
 (1, 'PG', 'California', Decimal('65.88')),
 (18, 'NC-17', 'So Paulo', Decimal('65.86')),
 (21, 'R', 'So Paulo', Decimal('63.86')),
 (30, 'NC-17', 'Buenos Aires', Decimal('63.86')),
 (30, 'PG', 'Southern Tagalog', Decimal('61.88')),
 (30, 'PG', 'So Paulo', Decimal('61.86')),
 (30, 'R', 'Buenos Aires', Decimal('61.84')),
 (18, 'NC-17', 'Maharashtra', Decimal('59.90')),
 (30, 'G', 'California', Decimal('59.90')),
 (21, 'PG-13', 'Uttar Pradesh', Decimal('59.88')),
 (10, 'R', 'Maharashtra', Decimal('59.86')),
 (20, 'PG', 'Shandong', Decimal('59.86')),
 (18, 'R', 'Sumy', Decimal('57.94')),
 (21, 'PG-13', 'Southern Tagalog', Decimal('57.92')),
 (29, 'NC-17', 'So Paulo', Decimal('57.90'))]

# Grouping Sets
- It happens a lot that for a 3 dimensions, you want to aggregate a fact:
    - by nothing (total)
    - then by the 1st dimension
    - then by the 2nd 
    - then by the 3rd 
    - then by the 1st and 2nd
    - then by the 2nd and 3rd
    - then by the 1st and 3rd
    - then by the 1st and 2nd and 3rd
    
- Since this is very common, and in all cases, we are iterating through all the fact table anyhow, there is a move clever way to do that using the SQL grouping statement "GROUPING SETS"

## total revenue

In [10]:
%%sql
SELECT sum(sales_amount) as revenue
FROM factSales

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(Decimal('134833.02'),)]

## revenue by country

In [11]:
%%sql
SELECT dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by  dimStore.country
order by dimStore.country, revenue desc;

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[('Australia', Decimal('67453.54')), ('Canada', Decimal('67379.48'))]

## revenue by month

In [12]:
%%sql
SELECT dimDate.month,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
GROUP by dimDate.month
order by dimDate.month, revenue desc;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, Decimal('9648.86')),
 (2, Decimal('19263.76')),
 (3, Decimal('47773.12')),
 (4, Decimal('57118.92')),
 (5, Decimal('1028.36'))]

## revenue by month & country

In [13]:
%%sql
SELECT dimDate.month,dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by (dimDate.month, dimStore.country)
order by dimDate.month, dimStore.country, revenue desc;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[(1, 'Australia', Decimal('4728.38')),
 (1, 'Canada', Decimal('4920.48')),
 (2, 'Australia', Decimal('9790.20')),
 (2, 'Canada', Decimal('9473.56')),
 (3, 'Australia', Decimal('24120.66')),
 (3, 'Canada', Decimal('23652.46')),
 (4, 'Australia', Decimal('28272.14')),
 (4, 'Canada', Decimal('28846.78')),
 (5, 'Australia', Decimal('542.16')),
 (5, 'Canada', Decimal('486.20'))]

## revenue total, by month, by country, by month & country All in one shot
- watch the nones

In [14]:
%%time
%%sql
SELECT dimDate.month,dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate  on (dimDate.date_key  = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by grouping sets ((), dimDate.month,  dimStore.country, (dimDate.month,  dimStore.country));

 * postgresql://student:***@127.0.0.1:5432/pagila
18 rows affected.
CPU times: user 2.14 ms, sys: 0 ns, total: 2.14 ms
Wall time: 18.8 ms

[(1, 'Australia', Decimal('4728.38')),
 (1, 'Canada', Decimal('4920.48')),
 (1, None, Decimal('9648.86')),
 (2, 'Australia', Decimal('9790.20')),
 (2, 'Canada', Decimal('9473.56')),
 (2, None, Decimal('19263.76')),
 (3, 'Australia', Decimal('24120.66')),
 (3, 'Canada', Decimal('23652.46')),
 (3, None, Decimal('47773.12')),
 (4, 'Australia', Decimal('28272.14')),
 (4, 'Canada', Decimal('28846.78')),
 (4, None, Decimal('57118.92')),
 (5, 'Australia', Decimal('542.16')),
 (5, 'Canada', Decimal('486.20')),
 (5, None, Decimal('1028.36')),
 (None, None, Decimal('134833.02')),
 (None, 'Canada', Decimal('67379.48')),
 (None, 'Australia', Decimal('67453.54'))]

# CUBE 
- Group by CUBE (dim1, dim2, ..) , produces all combinations of different lenghts in one go.
- This view could be materialized in a view and queried which would save lots repetitive aggregations

```SQL
SELECT dimDate.month,dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate  on (dimDate.date_key   = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by cube(dimDate.month,  dimStore.country);
```

In [15]:
%%time
%%sql
SELECT dimDate.month,dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by cube(dimDate.month,  dimStore.country);

 * postgresql://student:***@127.0.0.1:5432/pagila
18 rows affected.
CPU times: user 1.94 ms, sys: 198 Âµs, total: 2.14 ms
Wall time: 18.6 ms

[(1, 'Australia', Decimal('4728.38')),
 (1, 'Canada', Decimal('4920.48')),
 (1, None, Decimal('9648.86')),
 (2, 'Australia', Decimal('9790.20')),
 (2, 'Canada', Decimal('9473.56')),
 (2, None, Decimal('19263.76')),
 (3, 'Australia', Decimal('24120.66')),
 (3, 'Canada', Decimal('23652.46')),
 (3, None, Decimal('47773.12')),
 (4, 'Australia', Decimal('28272.14')),
 (4, 'Canada', Decimal('28846.78')),
 (4, None, Decimal('57118.92')),
 (5, 'Australia', Decimal('542.16')),
 (5, 'Canada', Decimal('486.20')),
 (5, None, Decimal('1028.36')),
 (None, None, Decimal('134833.02')),
 (None, 'Canada', Decimal('67379.48')),
 (None, 'Australia', Decimal('67453.54'))]

## revenue total, by month, by country, by month & country All in one shot, NAIVE way

In [16]:
%%time
%%sql
SELECT  NULL as month, NULL as country, sum(sales_amount) as revenue
FROM factSales
    UNION all 
SELECT NULL, dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by  dimStore.country
    UNION all 
SELECT cast(dimDate.month as text) , NULL, sum(sales_amount) as revenue
FROM factSales
JOIN dimDate on (dimDate.date_key = factSales.date_key)
GROUP by dimDate.month
    UNION all
SELECT cast(dimDate.month as text),dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by (dimDate.month, dimStore.country)

 * postgresql://student:***@127.0.0.1:5432/pagila
18 rows affected.
CPU times: user 3.07 ms, sys: 0 ns, total: 3.07 ms
Wall time: 33.2 ms

[(None, None, Decimal('134833.02')),
 (None, 'Canada', Decimal('67379.48')),
 (None, 'Australia', Decimal('67453.54')),
 ('3', None, Decimal('47773.12')),
 ('5', None, Decimal('1028.36')),
 ('4', None, Decimal('57118.92')),
 ('2', None, Decimal('19263.76')),
 ('1', None, Decimal('9648.86')),
 ('1', 'Australia', Decimal('4728.38')),
 ('1', 'Canada', Decimal('4920.48')),
 ('2', 'Australia', Decimal('9790.20')),
 ('2', 'Canada', Decimal('9473.56')),
 ('3', 'Australia', Decimal('24120.66')),
 ('3', 'Canada', Decimal('23652.46')),
 ('4', 'Australia', Decimal('28272.14')),
 ('4', 'Canada', Decimal('28846.78')),
 ('5', 'Australia', Decimal('542.16')),
 ('5', 'Canada', Decimal('486.20'))]